In [2]:
import pandas as pd

pd.read_csv('Book3.csv')

  Name  Agbe       City
0    A    24     Queens
1    B    34  Manhattan
2    C    30     Queens
3    D    34  Manhattan
4    E    34  Manhattan
5    F    20  Manhattan

In [11]:
joshidf = pd.read_csv('http://blockchainainyc.com/wp-content/uploads/2018/06/pandas17june.csv')

In [5]:
joshidf

  Name City  Age  Salary Gender  Distance
0    A    M   32   12312      M        10
1    B    B   34  231231      F        14
2    C    Q   54  321321      F        32
3    D    M   43   32131      M        21

In [7]:
joshidf.to_pickle('joshi.p')

In [8]:
joshidf

  Name City  Age  Salary Gender  Distance
0    A    M   32   12312      M        10
1    B    B   34  231231      F        14
2    C    Q   54  321321      F        32
3    D    M   43   32131      M        21

In [13]:
#select * from joshidf where city = 'M'
# Excel filter, using drup down

joshidf [joshidf['City'] == 'M']

  Name City  Age  Salary Gender  Distance
0    A    M   32   12312      M        10
3    D    M   43   32131      M        21

In [14]:
joshidf['City'] == 'M'

0     True
1    False
2    False
3     True
Name: City, dtype: bool